---
type: LinkedResourceOpeningEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 2
tags: [revit-api, class]
---

# LinkedResourceOpeningEventArgs

`Autodesk.Revit.DB.Events.LinkedResourceOpeningEventArgs` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | LinkedResourcePathName | 2018 | `public string LinkedResourcePathName { get ; }` |
| Property | ResourceType | 2018 | `public ExternalResourceType ResourceType { get ; }` |